// Math.abs(x)
// Возвращает абсолютное значение числа.

// Math.ceil(x)
// Возвращает значение числа, округлённое к большему целому.
// Math.ceil(7.004);  // 8

// Math.floor(x)
// Возвращает значение числа, округлённое к меньшему целому
// Math.floor( 45.95); //  45

// Math.max( )
// Возвращает наибольшее число из своих аргументов.
// Math.max(10, 20); //20

// Math.min( )
// Возвращает наименьшее число из своих аргументов.
// Math.min(10, 20); //10

// Math.pow(base, exponent)
// Возвращает основание в степени экспоненты, то есть, значение выражения основаниеэкспонента.
// Math.pow(7, 2); // 49

// Math.random()
// Возвращает псевдослучайное число в диапазоне от 0(включая) до 1(не включая).

// Math.round(x)
// Возвращает значение числа, округлённое до ближайшего целого.
// x = Math.round(20.49); // 20
// x = Math.round(20.5); // 21






// Math.exp(x)
// Возвращает Ex, где x — аргумент, а E — число Эйлера (2,718…), основание натурального логарифма.

// Math.sign(x) Экспериментальная возможность
// Возвращает знак числа, указывающий, является ли число положительным, отрицательным или нулём.

// Math.cbrt(x) Экспериментальная возможность
// Возвращает кубический корень числа.

// Math.sqrt(x)
// Возвращает положительный квадратный корень числа.
